{
  "pokemons": [
    { "id": 1, "name": "Cyndaquil", "pokemonType": "Fire", "pokemonImage": "http://cdn.bulbagarden.net/upload/thumb/9/9b/155Cyndaquil.png/250px-155Cyndaquil.png", "description": "Cyndaquil is a small, bipedal Pokémon with bluish fur on top of its body, and a milky color on the underside. Cyndaquil seems to be a composite of features from the echidna and the shrew. The echidna features are the flames from its back, while its general body shape is shrew-like. Its eyes are often closed and it has a long, thin snout. It lacks claws on its forelimbs, but has a single claw on each hind foot. Cyndaquil is usually timid by nature and often curls into a ball when intimidated. It has four red spots on its back from which its flames erupt. Cyndaquil is capable of defending itself using these flames. The fire grows more powerful as Cyndaquil becomes more angry or defensive. Though rare in the wild, few can be found living on grasslands."},
    { "id": 2, "name": "Chikorita", "pokemonType": "Grass", "pokemonImage": "http://cdn.bulbagarden.net/upload/thumb/b/bf/152Chikorita.png/250px-152Chikorita.png", "description": "Chikorita is a small, pale green Pokémon with a darker necklace of buds. It has a large head in proportion to the rest of its body with large red eyes that appear to have no pupils. It has four short legs with a single nailed toe on each and a small tail. Its most distinguishing feature is the large leaf on the top of its head, which is usually longer than the rest of its body. Aside from the soothing aroma that wafts from its leaf, Chikorita uses its leaf to determine the temperature and humidity of the surrounding air. Chikorita can be found in grasslands throughout the Johto region. However, due to its status as a starter Pokémon, a wild Chikorita is hard to come by and it is generally found under the ownership of Trainers. Chikorita tends to be docile in nature due to its domestication from birth." },
    { "id": 3, "name": "Totodile", "pokemonType": "Water", "pokemonImage": "http://cdn.bulbagarden.net/upload/thumb/d/df/158Totodile.png/250px-158Totodile.png", "description": "Totodile resembles a bipedal, blue crocodile with red spines on its back and tail. The spine on its back is larger with additional ridges. Totodile's head is large, with ridges above its eyes. Much of the head's size is composed of Totodile's snout and strong jaws. There are two visible teeth on the tip of its upper jaw, and two rows of three teeth on each side of its lower jaw. On its chest is a yellow, somewhat V-shaped pattern that extends to its arms with a line bisecting the pattern. Totodile has five sharp claws and three toes. Its eyes are red and surrounded by a dark blue or black pattern. Totodile tends to be playful by nature, and has a habit of biting anything it sees, including its Trainer. In the wild, Totodile prefers to live along the edges of bodies of water."}
  ]
}
